Deadline039/stm32-dma-uart-demo/f429/User/Bsp/OnChip/Src/bsp_dma_uart.c
/**
 * @file    dma_uart.c
 * @author  Deadline039
 * @brief   使用DMA+半满中断+满中断+空闲中断实现高可靠串口数据收发
 * @version 1.1
 * @date    2024-01-18
 * @note    stm32f429串口DMA配置文件
 * @ref     https://github.com/Prry/stm32-uart-dma
 *          https://gitee.com/wei513723/stm32-stable-uart-transmit-receive
 */

#include "bsp_core.h"
#include "bsp_uart.h"
#include "ring_fifo.h"

#include <string.h>

void uart_dmatx_clear_tc_flag(UART_HandleTypeDef *huart);

void uart_dmarx_halfdone_callback(UART_HandleTypeDef *huart);
void uart_dmarx_done_callback(UART_HandleTypeDef *huart);

/**
 * @brief 串口发送缓冲区
 */
typedef struct {
    uint8_t *send_buf;     /*!< 发送数据缓冲区 */
    uint32_t head_ptr;     /*!< 位置指针, 用来控制DMA传输的长度 */
    size_t send_buf_size;  /*!< 缓冲区大小, 避免溢出 */
    __IO uint32_t tc_flag; /*!< 是否发送完成, 0-未完成; 1-完成 */
} uart_tx_buf_t;

/**
 * @brief 串口接收缓冲区
 *
 */
typedef struct {
    ring_fifo_t *rx_fifo; /*!< 接收FIFO */
    uint8_t *rx_fifo_buf; /*!< FIFO数据存储区 */
    uint8_t *recv_buf;    /*!< DMA接收数据缓冲区 */
    uint32_t head_ptr;    /*!< 位置指针, 用来控制半满和溢出 */
} uart_rx_fifo_t;

#if (USART1_ENABLE == 1)

#if (USART1_USE_DMA_TX == 1)

static DMA_HandleTypeDef usart1_dmatx_handle;
static uart_tx_buf_t usart1_tx_buf;

/**
 * @brief 串口1发送DMA初始化
 *
 */
void usart1_dmatx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    usart1_dmatx_handle.Instance = DMA2_Stream7;
    usart1_dmatx_handle.Init.Channel = DMA_CHANNEL_4;
    usart1_dmatx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    usart1_dmatx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    usart1_dmatx_handle.Init.MemInc = DMA_MINC_ENABLE;
    usart1_dmatx_handle.Init.Mode = DMA_NORMAL;
    usart1_dmatx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    usart1_dmatx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    usart1_dmatx_handle.Init.Priority = USART1_DMA_TX_PRIORITY;

    usart1_tx_buf.send_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART1_TX_BUF_SIZE);
    usart1_tx_buf.send_buf_size = USART1_TX_BUF_SIZE;
#ifdef DEBUG
    assert(usart1_tx_buf.send_buf != NULL);
#endif /* DEBUG */

    usart1_tx_buf.tc_flag = 1;

    __HAL_RCC_DMA2_CLK_ENABLE();
    res = HAL_DMA_Init(&usart1_dmatx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&usart1_handle, hdmatx, usart1_dmatx_handle);

    HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, USART1_DMA_TX_IT_PREEMPT,
                         USART1_DMA_TX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&usart1_handle, HAL_UART_TX_COMPLETE_CB_ID,
                              uart_dmatx_clear_tc_flag);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口1发送中断句柄
 *
 */
void DMA2_Stream7_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart1_dmatx_handle);
}
#endif /* USART1_USE_DMA_TX == 1 */

#if (USART1_USE_DMA_RX == 1)

static DMA_HandleTypeDef usart1_dmarx_handle;
static uart_rx_fifo_t usart1_rx_fifo;

/**
 * @brief 串口1接收DMA初始化
 *
 */
void usart1_dmarx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    usart1_dmarx_handle.Instance = DMA2_Stream5;
    usart1_dmarx_handle.Init.Channel = DMA_CHANNEL_4;
    usart1_dmarx_handle.Init.Direction = DMA_PERIPH_TO_MEMORY;
    usart1_dmarx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    usart1_dmarx_handle.Init.MemInc = DMA_MINC_ENABLE;
    usart1_dmarx_handle.Init.Mode = DMA_CIRCULAR;
    usart1_dmarx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    usart1_dmarx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    usart1_dmarx_handle.Init.Priority = USART1_DMA_RX_PRIORITY;

    usart1_rx_fifo.head_ptr = 0;
    usart1_rx_fifo.recv_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART1_RX_BUF_SIZE);
#ifdef DEBUG
    assert(usart1_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

    usart1_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART1_RX_FIFO_SZIE);
#ifdef DEBUG
    assert(usart1_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

    usart1_rx_fifo.rx_fifo =
        ring_fifo_init(usart1_rx_fifo.rx_fifo_buf,
                       sizeof(uint8_t) * USART1_RX_FIFO_SZIE, RF_TYPE_STREAM);
#ifdef DEBUG
    assert(usart1_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

    __HAL_RCC_DMA2_CLK_ENABLE();
    res = HAL_DMA_Init(&usart1_dmarx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&usart1_handle, hdmarx, usart1_dmarx_handle);

    HAL_NVIC_SetPriority(DMA2_Stream5_IRQn, USART1_DMA_RX_IT_PREEMPT,
                         USART1_DMA_RX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA2_Stream5_IRQn);

#if USART1_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&usart1_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&usart1_handle);
#endif /* USART1_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&usart1_handle, (uint8_t *)usart1_rx_fifo.recv_buf,
                         USART1_RX_BUF_SIZE);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&usart1_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&usart1_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口1接收中断句柄
 *
 */
void DMA2_Stream5_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart1_dmarx_handle);
}
#endif /* USART1_USE_DMA_RX == 1 */

#endif /* USART1_ENABLE == 1 */

#if (USART2_ENABLE == 1)

#if (USART2_USE_DMA_TX == 1)

static DMA_HandleTypeDef usart2_dmatx_handle;
static uart_tx_buf_t usart2_tx_buf;

/**
 * @brief 串口2发送DMA初始化
 *
 */
void usart2_dmatx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    usart2_dmatx_handle.Instance = DMA1_Stream6;
    usart2_dmatx_handle.Init.Channel = DMA_CHANNEL_4;
    usart2_dmatx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    usart2_dmatx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    usart2_dmatx_handle.Init.MemInc = DMA_MINC_ENABLE;
    usart2_dmatx_handle.Init.Mode = DMA_NORMAL;
    usart2_dmatx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    usart2_dmatx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    usart2_dmatx_handle.Init.Priority = USART2_DMA_TX_PRIORITY;

    usart2_tx_buf.send_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART2_TX_BUF_SIZE);
    usart2_tx_buf.send_buf_size = USART2_TX_BUF_SIZE;
#ifdef DEBUG
    assert(usart2_tx_buf.send_buf != NULL);
#endif /* DEBUG */

    usart2_tx_buf.tc_flag = 1;

