Deadline039/stm32-dma-uart-demo/f429/User/Bsp/OnChip/Src/bsp_dma_uart.c
    __HAL_RCC_DMA1_CLK_ENABLE();
    res = HAL_DMA_Init(&usart2_dmatx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&usart2_handle, hdmatx, usart2_dmatx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, USART2_DMA_TX_IT_PREEMPT,
                         USART2_DMA_TX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&usart2_handle, HAL_UART_TX_COMPLETE_CB_ID,
                              uart_dmatx_clear_tc_flag);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口2发送中断句柄
 *
 */
void DMA1_Stream6_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart2_dmatx_handle);
}
#endif /* USART2_USE_DMA_TX == 1 */

#if (USART2_USE_DMA_RX == 1)

static DMA_HandleTypeDef usart2_dmarx_handle;
static uart_rx_fifo_t usart2_rx_fifo;

/**
 * @brief 串口2接收DMA初始化
 *
 */
void usart2_dmarx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    usart2_dmarx_handle.Instance = DMA1_Stream5;
    usart2_dmarx_handle.Init.Channel = DMA_CHANNEL_4;
    usart2_dmarx_handle.Init.Direction = DMA_PERIPH_TO_MEMORY;
    usart2_dmarx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    usart2_dmarx_handle.Init.MemInc = DMA_MINC_ENABLE;
    usart2_dmarx_handle.Init.Mode = DMA_CIRCULAR;
    usart2_dmarx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    usart2_dmarx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    usart2_dmarx_handle.Init.Priority = USART2_DMA_RX_PRIORITY;

    usart2_rx_fifo.head_ptr = 0;
    usart2_rx_fifo.recv_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART2_RX_BUF_SIZE);
#ifdef DEBUG
    assert(usart2_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

    usart2_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART2_RX_FIFO_SZIE);
#ifdef DEBUG
    assert(usart2_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

    usart2_rx_fifo.rx_fifo =
        ring_fifo_init(usart2_rx_fifo.rx_fifo_buf,
                       sizeof(uint8_t) * USART2_RX_FIFO_SZIE, RF_TYPE_STREAM);
#ifdef DEBUG
    assert(usart2_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

    __HAL_RCC_DMA1_CLK_ENABLE();
    res = HAL_DMA_Init(&usart2_dmarx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&usart2_handle, hdmarx, usart2_dmarx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, USART2_DMA_RX_IT_PREEMPT,
                         USART2_DMA_RX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);

#if USART2_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&usart2_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&usart2_handle);
#endif /* USART2_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&usart2_handle, (uint8_t *)usart2_rx_fifo.recv_buf,
                         USART2_RX_BUF_SIZE);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&usart2_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&usart2_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口2接收中断句柄
 *
 */
void DMA1_Stream5_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart2_dmarx_handle);
}
#endif /* USART2_USE_DMA_RX == 1 */

#endif /* USART2_ENABLE == 1 */

#if (USART3_ENABLE == 1)

#if (USART3_USE_DMA_TX == 1)

static DMA_HandleTypeDef usart3_dmatx_handle;
static uart_tx_buf_t usart3_tx_buf;

/**
 * @brief 串口3发送DMA初始化
 *
 */
void usart3_dmatx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    usart3_dmatx_handle.Instance = DMA1_Stream3;
    usart3_dmatx_handle.Init.Channel = DMA_CHANNEL_4;
    usart3_dmatx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    usart3_dmatx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    usart3_dmatx_handle.Init.MemInc = DMA_MINC_ENABLE;
    usart3_dmatx_handle.Init.Mode = DMA_NORMAL;
    usart3_dmatx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    usart3_dmatx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    usart3_dmatx_handle.Init.Priority = USART3_DMA_TX_PRIORITY;

    usart3_tx_buf.send_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART3_TX_BUF_SIZE);
    usart3_tx_buf.send_buf_size = USART3_TX_BUF_SIZE;
#ifdef DEBUG
    assert(usart3_tx_buf.send_buf != NULL);
#endif /* DEBUG */

    usart3_tx_buf.tc_flag = 1;

    __HAL_RCC_DMA2_CLK_ENABLE();
    res = HAL_DMA_Init(&usart3_dmatx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&usart3_handle, hdmatx, usart3_dmatx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, USART3_DMA_TX_IT_PREEMPT,
                         USART3_DMA_TX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&usart3_handle, HAL_UART_TX_COMPLETE_CB_ID,
                              uart_dmatx_clear_tc_flag);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口3发送中断句柄
 *
 */
void DMA1_Stream3_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart3_dmatx_handle);
}
#endif /* USART3_USE_DMA_TX == 1 */

#if (USART3_USE_DMA_RX == 1)

static DMA_HandleTypeDef usart3_dmarx_handle;
static uart_rx_fifo_t usart3_rx_fifo;

/**
 * @brief 串口3接收DMA初始化
 *
 */
void usart3_dmarx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    usart3_dmarx_handle.Instance = DMA1_Stream1;
    usart3_dmarx_handle.Init.Channel = DMA_CHANNEL_4;
    usart3_dmarx_handle.Init.Direction = DMA_PERIPH_TO_MEMORY;
    usart3_dmarx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    usart3_dmarx_handle.Init.MemInc = DMA_MINC_ENABLE;
    usart3_dmarx_handle.Init.Mode = DMA_CIRCULAR;
    usart3_dmarx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    usart3_dmarx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    usart3_dmarx_handle.Init.Priority = USART3_DMA_RX_PRIORITY;

    usart3_rx_fifo.head_ptr = 0;
    usart3_rx_fifo.recv_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART3_RX_BUF_SIZE);
#ifdef DEBUG
    assert(usart3_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

    usart3_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART3_RX_FIFO_SZIE);
#ifdef DEBUG
    assert(usart3_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

    usart3_rx_fifo.rx_fifo =
        ring_fifo_init(usart3_rx_fifo.rx_fifo_buf,
                       sizeof(uint8_t) * USART3_RX_FIFO_SZIE, RF_TYPE_STREAM);
#ifdef DEBUG
    assert(usart3_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

    __HAL_RCC_DMA2_CLK_ENABLE();
    res = HAL_DMA_Init(&usart3_dmarx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&usart3_handle, hdmarx, usart3_dmarx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, USART3_DMA_RX_IT_PREEMPT,
                         USART3_DMA_RX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);

#if USART3_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&usart3_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&usart3_handle);
#endif /* USART3_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&usart3_handle, (uint8_t *)usart3_rx_fifo.recv_buf,
                         USART3_RX_BUF_SIZE);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&usart3_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&usart3_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口3接收中断句柄
 *
 */
void DMA1_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart3_dmarx_handle);
}
#endif /* USART3_USE_DMA_RX == 1 */

