Deadline039/stm32-dma-uart-demo/f429/User/Bsp/OnChip/Src/bsp_dma_uart.c
#endif /* USART3_ENABLE == 1 */

#if (UART4_ENABLE == 1)

#if (UART4_USE_DMA_TX == 1)

static DMA_HandleTypeDef uart4_dmatx_handle;
static uart_tx_buf_t uart4_tx_buf;

/**
 * @brief 串口4发送DMA初始化
 *
 */
void uart4_dmatx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    uart4_dmatx_handle.Instance = DMA1_Stream4;
    uart4_dmatx_handle.Init.Channel = DMA_CHANNEL_4;
    uart4_dmatx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    uart4_dmatx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uart4_dmatx_handle.Init.MemInc = DMA_MINC_ENABLE;
    uart4_dmatx_handle.Init.Mode = DMA_NORMAL;
    uart4_dmatx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uart4_dmatx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    uart4_dmatx_handle.Init.Priority = UART4_DMA_TX_PRIORITY;

    uart4_tx_buf.send_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART4_TX_BUF_SIZE);
    uart4_tx_buf.send_buf_size = UART4_TX_BUF_SIZE;
#ifdef DEBUG
    assert(uart4_tx_buf.send_buf != NULL);
#endif /* DEBUG */

    uart4_tx_buf.tc_flag = 1;

    __HAL_RCC_DMA1_CLK_ENABLE();
    res = HAL_DMA_Init(&uart4_dmatx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&uart4_handle, hdmatx, uart4_dmatx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, UART4_DMA_TX_IT_PREEMPT,
                         UART4_DMA_TX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&uart4_handle, HAL_UART_TX_COMPLETE_CB_ID,
                              uart_dmatx_clear_tc_flag);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口4发送中断句柄
 *
 */
void DMA1_Stream4_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart4_dmatx_handle);
}
#endif /* UART4_USE_DMA_TX == 1 */

#if (UART4_USE_DMA_RX == 1)

static DMA_HandleTypeDef uart4_dmarx_handle;
static uart_rx_fifo_t uart4_rx_fifo;

/**
 * @brief 串口4接收DMA初始化
 *
 */
void uart4_dmarx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    uart4_dmarx_handle.Instance = DMA1_Stream2;
    uart4_dmarx_handle.Init.Channel = DMA_CHANNEL_4;
    uart4_dmarx_handle.Init.Direction = DMA_PERIPH_TO_MEMORY;
    uart4_dmarx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uart4_dmarx_handle.Init.MemInc = DMA_MINC_ENABLE;
    uart4_dmarx_handle.Init.Mode = DMA_CIRCULAR;
    uart4_dmarx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uart4_dmarx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    uart4_dmarx_handle.Init.Priority = UART4_DMA_RX_PRIORITY;

    uart4_rx_fifo.head_ptr = 0;
    uart4_rx_fifo.recv_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART4_RX_BUF_SIZE);
#ifdef DEBUG
    assert(uart4_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

    uart4_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART4_RX_FIFO_SZIE);
#ifdef DEBUG
    assert(uart4_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

    uart4_rx_fifo.rx_fifo =
        ring_fifo_init(uart4_rx_fifo.rx_fifo_buf,
                       sizeof(uint8_t) * UART4_RX_FIFO_SZIE, RF_TYPE_STREAM);
#ifdef DEBUG
    assert(uart4_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

    __HAL_RCC_DMA1_CLK_ENABLE();
    res = HAL_DMA_Init(&uart4_dmarx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&uart4_handle, hdmarx, uart4_dmarx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, UART4_DMA_RX_IT_PREEMPT,
                         UART4_DMA_RX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);

#if UART4_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&uart4_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&uart4_handle);
#endif /* UART4_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&uart4_handle, (uint8_t *)uart4_rx_fifo.recv_buf,
                         UART4_RX_BUF_SIZE);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&uart4_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&uart4_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口4接收中断句柄
 *
 */
void DMA1_Stream2_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart4_dmarx_handle);
}
#endif /* UART4_USE_DMA_RX == 1 */

#endif /* UART4_ENABLE == 1 */

#if (UART5_ENABLE == 1)

#if (UART5_USE_DMA_TX == 1)

static DMA_HandleTypeDef uart5_dmatx_handle;
static uart_tx_buf_t uart5_tx_buf;

/**
 * @brief 串口5发送DMA初始化
 *
 */
void uart5_dmatx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    uart5_dmatx_handle.Instance = DMA1_Stream7;
    uart5_dmatx_handle.Init.Channel = DMA_CHANNEL_4;
    uart5_dmatx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    uart5_dmatx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uart5_dmatx_handle.Init.MemInc = DMA_MINC_ENABLE;
    uart5_dmatx_handle.Init.Mode = DMA_NORMAL;
    uart5_dmatx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uart5_dmatx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    uart5_dmatx_handle.Init.Priority = UART5_DMA_TX_PRIORITY;

    uart5_tx_buf.send_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART5_TX_BUF_SIZE);
    uart5_tx_buf.send_buf_size = UART5_TX_BUF_SIZE;
#ifdef DEBUG
    assert(uart5_tx_buf.send_buf != NULL);
#endif /* DEBUG */

    uart5_tx_buf.tc_flag = 1;

    __HAL_RCC_DMA1_CLK_ENABLE();
    res = HAL_DMA_Init(&uart5_dmatx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&uart5_handle, hdmatx, uart5_dmatx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, UART5_DMA_TX_IT_PREEMPT,
                         UART5_DMA_TX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&uart5_handle, HAL_UART_TX_COMPLETE_CB_ID,
                              uart_dmatx_clear_tc_flag);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口5发送中断句柄
 *
 */
void DMA1_Stream7_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart5_dmatx_handle);
}
#endif /* UART5_USE_DMA_TX == 1 */

#if (UART5_USE_DMA_RX == 1)

static DMA_HandleTypeDef uart5_dmarx_handle;
static uart_rx_fifo_t uart5_rx_fifo;

/**
 * @brief 串口5接收DMA初始化
 *
 */
void uart5_dmarx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    uart5_dmarx_handle.Instance = DMA1_Stream0;
    uart5_dmarx_handle.Init.Channel = DMA_CHANNEL_4;
    uart5_dmarx_handle.Init.Direction = DMA_PERIPH_TO_MEMORY;
    uart5_dmarx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uart5_dmarx_handle.Init.MemInc = DMA_MINC_ENABLE;
    uart5_dmarx_handle.Init.Mode = DMA_CIRCULAR;
    uart5_dmarx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uart5_dmarx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    uart5_dmarx_handle.Init.Priority = UART5_DMA_RX_PRIORITY;

