Deadline039/stm32-dma-uart-demo/f429/User/Bsp/OnChip/Src/bsp_dma_uart.c
    uart5_rx_fifo.head_ptr = 0;
    uart5_rx_fifo.recv_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART5_RX_BUF_SIZE);
#ifdef DEBUG
    assert(uart5_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

    uart5_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART5_RX_FIFO_SZIE);
#ifdef DEBUG
    assert(uart5_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

    uart5_rx_fifo.rx_fifo =
        ring_fifo_init(uart5_rx_fifo.rx_fifo_buf,
                       sizeof(uint8_t) * UART5_RX_FIFO_SZIE, RF_TYPE_STREAM);
#ifdef DEBUG
    assert(uart5_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

    __HAL_RCC_DMA1_CLK_ENABLE();
    res = HAL_DMA_Init(&uart5_dmarx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&uart5_handle, hdmarx, uart5_dmarx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, UART5_DMA_RX_IT_PREEMPT,
                         UART5_DMA_RX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);

#if UART5_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&uart5_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&uart5_handle);
#endif /* UART5_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&uart5_handle, (uint8_t *)uart5_rx_fifo.recv_buf,
                         UART5_RX_BUF_SIZE);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&uart5_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&uart5_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口5接收中断句柄
 *
 */
void DMA1_Stream0_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart5_dmarx_handle);
}
#endif /* UART5_USE_DMA_RX == 1 */

#endif /* UART5_ENABLE == 1 */

#if (USART6_ENABLE == 1)

#if (USART6_USE_DMA_TX == 1)

static DMA_HandleTypeDef usart6_dmatx_handle;
static uart_tx_buf_t usart6_tx_buf;

/**
 * @brief 串口6发送DMA初始化
 *
 */
void usart6_dmatx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    usart6_dmatx_handle.Instance = DMA2_Stream6;
    usart6_dmatx_handle.Init.Channel = DMA_CHANNEL_5;
    usart6_dmatx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    usart6_dmatx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    usart6_dmatx_handle.Init.MemInc = DMA_MINC_ENABLE;
    usart6_dmatx_handle.Init.Mode = DMA_NORMAL;
    usart6_dmatx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    usart6_dmatx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    usart6_dmatx_handle.Init.Priority = USART6_DMA_TX_PRIORITY;

    usart6_tx_buf.send_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART6_TX_BUF_SIZE);
    usart6_tx_buf.send_buf_size = USART6_TX_BUF_SIZE;
#ifdef DEBUG
    assert(usart6_tx_buf.send_buf != NULL);
#endif /* DEBUG */

    usart6_tx_buf.tc_flag = 1;

    __HAL_RCC_DMA2_CLK_ENABLE();
    res = HAL_DMA_Init(&usart6_dmatx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&usart6_handle, hdmatx, usart6_dmatx_handle);

    HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, USART6_DMA_TX_IT_PREEMPT,
                         USART6_DMA_TX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&usart6_handle, HAL_UART_TX_COMPLETE_CB_ID,
                              uart_dmatx_clear_tc_flag);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口6发送中断句柄
 *
 */
void DMA2_Stream6_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart6_dmatx_handle);
}
#endif /* USART6_USE_DMA_TX == 1 */

#if (USART6_USE_DMA_RX == 1)

static DMA_HandleTypeDef usart6_dmarx_handle;
static uart_rx_fifo_t usart6_rx_fifo;

/**
 * @brief 串口6接收DMA初始化
 *
 */
void usart6_dmarx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    usart6_dmarx_handle.Instance = DMA2_Stream1;
    usart6_dmarx_handle.Init.Channel = DMA_CHANNEL_5;
    usart6_dmarx_handle.Init.Direction = DMA_PERIPH_TO_MEMORY;
    usart6_dmarx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    usart6_dmarx_handle.Init.MemInc = DMA_MINC_ENABLE;
    usart6_dmarx_handle.Init.Mode = DMA_CIRCULAR;
    usart6_dmarx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    usart6_dmarx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    usart6_dmarx_handle.Init.Priority = USART6_DMA_RX_PRIORITY;

    usart6_rx_fifo.head_ptr = 0;
    usart6_rx_fifo.recv_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART6_RX_BUF_SIZE);
#ifdef DEBUG
    assert(usart6_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

    usart6_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * USART6_RX_FIFO_SZIE);
#ifdef DEBUG
    assert(usart6_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

    usart6_rx_fifo.rx_fifo =
        ring_fifo_init(usart6_rx_fifo.rx_fifo_buf,
                       sizeof(uint8_t) * USART6_RX_FIFO_SZIE, RF_TYPE_STREAM);
#ifdef DEBUG
    assert(usart6_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

    __HAL_RCC_DMA2_CLK_ENABLE();
    res = HAL_DMA_Init(&usart6_dmarx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&usart6_handle, hdmarx, usart6_dmarx_handle);

    HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, USART6_DMA_RX_IT_PREEMPT,
                         USART6_DMA_RX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);

#if USART6_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&usart6_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&usart6_handle);
#endif /* USART6_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&usart6_handle, (uint8_t *)usart6_rx_fifo.recv_buf,
                         USART6_RX_BUF_SIZE);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&usart6_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&usart6_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口6接收中断句柄
 *
 */
void DMA2_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart6_dmarx_handle);
}
#endif /* USART6_USE_DMA_RX == 1 */

#endif /* USART6_ENABLE == 1 */

#if (UART7_ENABLE == 1)

#if (UART7_USE_DMA_TX == 1)

static DMA_HandleTypeDef uart7_dmatx_handle;
static uart_tx_buf_t uart7_tx_buf;

/**
 * @brief 串口7发送DMA初始化
 *
 */
void uart7_dmatx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    uart7_dmatx_handle.Instance = DMA1_Stream1;
    uart7_dmatx_handle.Init.Channel = DMA_CHANNEL_5;
    uart7_dmatx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    uart7_dmatx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uart7_dmatx_handle.Init.MemInc = DMA_MINC_ENABLE;
    uart7_dmatx_handle.Init.Mode = DMA_NORMAL;
    uart7_dmatx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uart7_dmatx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    uart7_dmatx_handle.Init.Priority = UART7_DMA_TX_PRIORITY;

    uart7_tx_buf.send_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART7_TX_BUF_SIZE);
    uart7_tx_buf.send_buf_size = UART7_TX_BUF_SIZE;
#ifdef DEBUG
    assert(uart7_tx_buf.send_buf != NULL);
#endif /* DEBUG */

    uart7_tx_buf.tc_flag = 1;

