Deadline039/stm32-dma-uart-demo/f429/User/Bsp/OnChip/Src/bsp_dma_uart.c
    uart7_rx_fifo.rx_fifo =
        ring_fifo_init(uart7_rx_fifo.rx_fifo_buf,
                       sizeof(uint8_t) * UART7_RX_FIFO_SZIE, RF_TYPE_STREAM);
#ifdef DEBUG
    assert(uart7_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

    __HAL_RCC_DMA1_CLK_ENABLE();
    res = HAL_DMA_Init(&uart7_dmarx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&uart7_handle, hdmarx, uart7_dmarx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, UART7_DMA_RX_IT_PREEMPT,
                         UART7_DMA_RX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

#if UART7_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&uart7_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&uart7_handle);
#endif /* UART7_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&uart7_handle, (uint8_t *)uart7_rx_fifo.recv_buf,
                         UART7_RX_BUF_SIZE);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&uart7_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&uart7_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口7接收中断句柄
 *
 */
void DMA1_Stream3_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart7_dmarx_handle);
}
#endif /* UART7_USE_DMA_RX == 1 */

#endif /* UART7_ENABLE == 1 */

#if (UART8_ENABLE == 1)

#if (UART8_USE_DMA_TX == 1)

static DMA_HandleTypeDef uart8_dmatx_handle;
static uart_tx_buf_t uart8_tx_buf;

/**
 * @brief 串口8发送DMA初始化
 *
 */
void uart8_dmatx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    uart8_dmatx_handle.Instance = DMA1_Stream0;
    uart8_dmatx_handle.Init.Channel = DMA_CHANNEL_5;
    uart8_dmatx_handle.Init.Direction = DMA_MEMORY_TO_PERIPH;
    uart8_dmatx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uart8_dmatx_handle.Init.MemInc = DMA_MINC_ENABLE;
    uart8_dmatx_handle.Init.Mode = DMA_NORMAL;
    uart8_dmatx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uart8_dmatx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    uart8_dmatx_handle.Init.Priority = UART8_DMA_TX_PRIORITY;

    uart8_tx_buf.send_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART8_TX_BUF_SIZE);
    uart8_tx_buf.send_buf_size = UART8_TX_BUF_SIZE;
#ifdef DEBUG
    assert(uart8_tx_buf.send_buf != NULL);
#endif /* DEBUG */

    uart8_tx_buf.tc_flag = 1;

    __HAL_RCC_DMA1_CLK_ENABLE();
    res = HAL_DMA_Init(&uart8_dmatx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&uart8_handle, hdmatx, uart8_dmatx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, UART8_DMA_TX_IT_PREEMPT,
                         UART8_DMA_TX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&uart8_handle, HAL_UART_TX_COMPLETE_CB_ID,
                              uart_dmatx_clear_tc_flag);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口8发送中断句柄
 *
 */
void DMA1_Stream0_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart8_dmatx_handle);
}
#endif /* UART8_USE_DMA_TX == 1 */

#if (UART8_USE_DMA_RX == 1)

static DMA_HandleTypeDef uart8_dmarx_handle;
static uart_rx_fifo_t uart8_rx_fifo;

/**
 * @brief 串口8接收DMA初始化
 *
 */
void uart8_dmarx_init(void) {
    HAL_StatusTypeDef res = HAL_OK;

    uart8_dmarx_handle.Instance = DMA1_Stream6;
    uart8_dmarx_handle.Init.Channel = DMA_CHANNEL_5;
    uart8_dmarx_handle.Init.Direction = DMA_PERIPH_TO_MEMORY;
    uart8_dmarx_handle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uart8_dmarx_handle.Init.MemInc = DMA_MINC_ENABLE;
    uart8_dmarx_handle.Init.Mode = DMA_CIRCULAR;
    uart8_dmarx_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uart8_dmarx_handle.Init.PeriphInc = DMA_PINC_DISABLE;
    uart8_dmarx_handle.Init.Priority = UART8_DMA_RX_PRIORITY;

    uart8_rx_fifo.head_ptr = 0;
    uart8_rx_fifo.recv_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART8_RX_BUF_SIZE);
#ifdef DEBUG
    assert(uart8_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

    uart8_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc(sizeof(uint8_t) * UART8_RX_FIFO_SZIE);
#ifdef DEBUG
    assert(uart8_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

    uart8_rx_fifo.rx_fifo =
        ring_fifo_init(uart8_rx_fifo.rx_fifo_buf,
                       sizeof(uint8_t) * UART8_RX_FIFO_SZIE, RF_TYPE_STREAM);
#ifdef DEBUG
    assert(uart8_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

    __HAL_RCC_DMA1_CLK_ENABLE();
    res = HAL_DMA_Init(&uart8_dmarx_handle);
#ifdef DEBUG
    assert(res == HAL_OK);
#endif /* DEBUG */

    __HAL_LINKDMA(&uart8_handle, hdmarx, uart8_dmarx_handle);

    HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, UART8_DMA_RX_IT_PREEMPT,
                         UART8_DMA_RX_IT_SUB);
    HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);

#if UART8_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&uart8_handle, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&uart8_handle);
#endif /* UART8_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&uart8_handle, (uint8_t *)uart8_rx_fifo.recv_buf,
                         UART8_RX_BUF_SIZE);

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    HAL_UART_RegisterCallback(&uart8_handle, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                              uart_dmarx_halfdone_callback);
    HAL_UART_RegisterCallback(&uart8_handle, HAL_UART_RX_COMPLETE_CB_ID,
                              uart_dmarx_done_callback);
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 串口8接收中断句柄
 *
 */
void DMA1_Stream6_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart8_dmarx_handle);
}
#endif /* UART8_USE_DMA_RX == 1 */

#endif /* UART8_ENABLE == 1 */

/*****************************************************************************
 * @defgroup 发送函数部分
 * @{
 */

/**
 * @brief 根据串口句柄, 判断是哪个发送缓冲区指针
 *
 * @param huart 串口句柄
 * @return 发送缓冲区指针
 */
static inline uart_tx_buf_t *uart_tx_identify(UART_HandleTypeDef *huart) {
    switch ((uintptr_t)(huart->Instance)) {

#if USART1_USE_DMA_TX
        case USART1_BASE: {
            return &usart1_tx_buf;
        }
#endif /* USART1_USE_DMA_TX */

#if USART2_USE_DMA_TX
        case USART2_BASE: {
            return &usart2_tx_buf;
        }
#endif /* USART2_USE_DMA_TX */

