Deadline039/stm32-dma-uart-demo/f429/User/Bsp/OnChip/Src/bsp_dma_uart.c
#if USART3_USE_DMA_TX
        case USART3_BASE: {
            return &usart3_tx_buf;
        }
#endif /* USART3_USE_DMA_TX */

#if UART4_USE_DMA_TX
        case UART4_BASE: {
            return &uart4_tx_buf;
        }
#endif /* UART4_USE_DMA_TX */

#if UART5_USE_DMA_TX
        case UART5_BASE: {
            return &uart5_tx_buf;
        }
#endif /* UART5_USE_DMA_TX */

#if USART6_USE_DMA_TX
        case USART6_BASE: {
            return &usart6_tx_buf;
        }
#endif /* USART6_USE_DMA_TX */

#if UART7_USE_DMA_TX
        case UART7_BASE: {
            return &uart7_tx_buf;
        }
#endif /* UART7_USE_DMA_TX */

#if UART8_USE_DMA_TX
        case UART8_BASE: {
            return &uart8_tx_buf;
        }
#endif /* UART8_USE_DMA_TX */

        default: {
        } break;
    }

    return NULL;
}

/**
 * @brief 清楚串口发送完成标志位
 *
 * @param huart 串口句柄
 */
void uart_dmatx_clear_tc_flag(UART_HandleTypeDef *huart) {
    uart_tx_buf_t *uart_tx_buf = uart_tx_identify(huart);
    if (uart_tx_buf == NULL) {
        return;
    }

    uart_tx_buf->tc_flag = 1;
}

/**
 * @brief 向串口发送缓冲区中写入数据
 *
 * @param huart 串口句柄
 * @param data 数据
 * @param len 数据长度
 * @return 成功写入的长度
 */
uint32_t uart_dmatx_write(UART_HandleTypeDef *huart, const void *data,
                          size_t len) {
    if ((data == NULL) || (len == 0)) {
        return 0;
    }

    uart_tx_buf_t *send_tx_buf = uart_tx_identify(huart);
    if (send_tx_buf == NULL) {
        return 0;
    }

    /* 计算当前缓冲区剩余长度 */
    uint32_t buf_remain = send_tx_buf->send_buf_size - send_tx_buf->head_ptr;

    /* 如果要写入的长度大于剩余长度, 为避免溢出, 只写入剩余的长度 */
    if (buf_remain < len) {
        memcpy(send_tx_buf->send_buf + send_tx_buf->head_ptr, data, buf_remain);
        send_tx_buf->head_ptr += buf_remain;
        return buf_remain;
    } else {
        memcpy(send_tx_buf->send_buf + send_tx_buf->head_ptr, data, len);
        send_tx_buf->head_ptr += len;
        return len;
    }
}

/**
 * @brief 把FIFO中的数据通过DMA发送
 *
 * @param huart 串口句柄
 * @return 成功发送的长度
 * @note 先使用`uart_dmatx_write`写入数据
 */
uint32_t uart_dmatx_send(UART_HandleTypeDef *huart) {
    uart_tx_buf_t *send_tx_buf = uart_tx_identify(huart);
    if (send_tx_buf == NULL) {
        return 0;
    }

    /* 未启用DMA */
    if (huart->hdmatx == NULL) {
        return 0;
    }

    /* 未发送完毕 */
    if (!send_tx_buf->tc_flag) {
        return 0;
    }

    uint32_t len = send_tx_buf->head_ptr;
    /* 缓冲区为空 */
    if (!len) {
        return 0;
    }

    send_tx_buf->tc_flag = 0;
    HAL_UART_Transmit_DMA(huart, send_tx_buf->send_buf, (uint16_t)len);
    send_tx_buf->head_ptr = 0;
    return len;
}

/**
 * @}
 */

/*****************************************************************************
 * @defgroup 接收函数部分
 * @{
 */

/**
 * @brief 根据串口句柄, 判断是哪个接收缓冲区指针
 *
 * @param huart 串口句柄
 * @return 接收缓冲区指针
 */
static inline uart_rx_fifo_t *uart_rx_identify(UART_HandleTypeDef *huart) {

    switch ((uintptr_t)huart->Instance) {
#if USART1_USE_DMA_RX
        case USART1_BASE: {
            return &usart1_rx_fifo;
        }
#endif /* USART1_USE_DMA_RX */

#if USART2_USE_DMA_RX
        case USART2_BASE: {
            return &usart2_rx_fifo;
        }
#endif /* USART2_USE_DMA_RX */

#if USART3_USE_DMA_RX
        case USART3_BASE: {
            return &usart3_rx_fifo;
        }
#endif /* USART3_USE_DMA_RX */

#if UART4_USE_DMA_RX
        case UART4_BASE: {
            return &uart4_rx_fifo;
        }
#endif /* UART4_USE_DMA_RX */

#if UART5_USE_DMA_RX
        case UART5_BASE: {
            return &uart5_rx_fifo;
        }
#endif /* UART5_USE_DMA_RX */

#if USART6_USE_DMA_RX
        case USART6_BASE: {
            return &usart6_rx_fifo;
        }
#endif /* USART6_USE_DMA_RX */

#if UART7_USE_DMA_RX
        case UART7_BASE: {
            return &uart7_rx_fifo;
        }
#endif /* UART7_USE_DMA_RX */

#if UART8_USE_DMA_RX
        case UART8_BASE: {
            return &uart8_rx_fifo;
        }
#endif /* UART8_USE_DMA_RX */

        default: {
        } break;
    }

    return NULL;
}

/**
 * @brief DMA接收空闲回调
 *
 * @param huart 串口句柄
 */
void uart_dmarx_idle_callback(UART_HandleTypeDef *huart) {
    uart_rx_fifo_t *uart_rx_fifo = uart_rx_identify(huart);
    if (uart_rx_fifo == NULL) {
        return;
    }

    uint32_t tail_ptr;
    uint32_t copy, offset;

    /**
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     * |     head_ptr          tail_ptr         |
     * |         |                 |            |
     * |         v                 v            |
     * | --------*******************----------- |
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     */

    /* 已接收 */
    tail_ptr = huart->RxXferSize - __HAL_DMA_GET_COUNTER(huart->hdmarx);

    offset = (uart_rx_fifo->head_ptr) % (uint32_t)(huart->RxXferSize);
    copy = tail_ptr - offset;
    uart_rx_fifo->head_ptr += copy;

    ring_fifo_write(uart_rx_fifo->rx_fifo, huart->pRxBuffPtr + offset, copy);
}

/**
 * @brief 串口DMA接收半满回调
 *
 * @param huart 串口句柄
 */
void uart_dmarx_halfdone_callback(UART_HandleTypeDef *huart) {
    uart_rx_fifo_t *uart_rx_fifo = uart_rx_identify(huart);
    if (uart_rx_fifo == NULL) {
        return;
    }

    uint32_t tail_ptr;
    uint32_t offset, copy;

    /**
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     * |                  half                  |
     * |     head_ptr   tail_ptr                |
     * |         |          |                   |
     * |         v          v                   |
     * | --------*******************----------- |
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     */

    tail_ptr = (huart->RxXferSize >> 1) + (huart->RxXferSize & 1);

    offset = (uart_rx_fifo->head_ptr) % (uint32_t)(huart->RxXferSize);
    copy = tail_ptr - offset;
    uart_rx_fifo->head_ptr += copy;

    ring_fifo_write(uart_rx_fifo->rx_fifo, huart->pRxBuffPtr + offset, copy);
}

/**
 * @brief 串口DMA溢满中断回调
 *
 * @param huart 串口句柄
 */
void uart_dmarx_done_callback(UART_HandleTypeDef *huart) {
    uart_rx_fifo_t *uart_rx_fifo = uart_rx_identify(huart);
    if (uart_rx_fifo == NULL) {
        return;
    }

    uint32_t tail_ptr;
    uint32_t offset, copy;

    /**
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     * |                  half                  |
     * |                    | head_ptr tail_ptr |
     * |                    |    |            | |
     * |                    v    v            v |
     * | ------------------------************** |
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     */

    tail_ptr = huart->RxXferSize;

    offset = (uart_rx_fifo->head_ptr) % (uint32_t)(huart->RxXferSize);
    copy = tail_ptr - offset;
    uart_rx_fifo->head_ptr += copy;

    ring_fifo_write(uart_rx_fifo->rx_fifo, huart->pRxBuffPtr + offset, copy);

    if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
        /* 非循环DMA, 重新打开DMA接收 */
        while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                    huart->RxXferSize) != HAL_OK) {
            __HAL_UNLOCK(huart);
        }
    }
}

/**
 * @brief 从接收FIFO读数据
 *
 * @param huart 串口句柄
 * @param buf 接收缓冲数组
 * @param len `buf`长度
 * @return 接收到的长度
 */
uint32_t uart_dmarx_read(UART_HandleTypeDef *huart, void *buf, size_t len) {
    if ((buf == NULL) || (len == 0)) {
        return 0;
    }
    uart_rx_fifo_t *uart_rx_fifo = uart_rx_identify(huart);

    if (uart_rx_fifo == NULL) {
        return 0;
    }

    return ring_fifo_read(uart_rx_fifo->rx_fifo, buf, len);
}

/**
 * @}
 */
